app/controllers/youtube_controller.rb

  def create

    @com = Comment.new(params[:com])
      if @com.save
---
INSERT INTO `comments` (`name`, `comment`, `created_at`, `updated_at`, `mail_id`) VALUES('karthik', 'nice trailer', '2010-11-05 15:05:26', '2010-11-05 15:05:26', 'karthik25101988@gmail.com')